Catalogs/СохраненныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СохраненныеНастройки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
				<xr:Item>Catalog.ГруппыПользователей</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастраиваемыйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьПриЗапуске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МТ_ПредставлениеЭлементаОтчета</Name>
					<Comment>Используется для сохранения представления элемента варианта аналитического отчета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПредставленияЭлементовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СохраненныеНастройки/Forms/ФормаВыбора_Управляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("РежимСохраненияНастройки", РежимСохраненияНастройки);
	Элементы.Группа_СохранениеВыбор.ТекущаяСтраница = ?(РежимСохраненияНастройки, Элементы.Страница_Сохранение, Элементы.Страница_Выбор);
	
	// +ВасильевИИ МТ 1 августа 2013 г. 14:05:47
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	// -ВасильевИИ МТ 1 августа 2013 г. 14:05:47
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариант(Команда)
	
	Закрыть(СохранитьНовуюНастройку());
	
КонецПроцедуры

&НаСервере
Функция СохранитьНовуюНастройку()
	
	НовыйЭлемент = Справочники.СохраненныеНастройки.СоздатьЭлемент();
	НовыйЭлемент.Наименование = Наименование;
	
	ЛевоеЗначение_НастраиваемыйОбъект = Новый ПолеКомпоновкиДанных("НастраиваемыйОбъект");
	ЛевоеЗначение_ТипНастройки        = Новый ПолеКомпоновкиДанных("ТипНастройки");
	
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ЛевоеЗначение_НастраиваемыйОбъект Тогда
			НастраиваемыйОбъект = Элемент.ПравоеЗначение;
		ИначеЕсли Элемент.ЛевоеЗначение = ЛевоеЗначение_ТипНастройки Тогда
			ТипНастройки = Элемент.ПравоеЗначение;
		КонецЕсли;
	КонецЦикла;
	
	НовыйЭлемент.НастраиваемыйОбъект = НастраиваемыйОбъект;
	НовыйЭлемент.Владелец            = ПараметрыСеанса.ТекущийПользователь;
	НовыйЭлемент.ТипНастройки        = ТипНастройки;
	
	НовыйПользователь = НовыйЭлемент.Пользователи.Добавить();
	НовыйПользователь.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	НовыйПользователь.ПравоИзменения = Истина;
	Отказ = Ложь;
	Сообщение = "";
	НовыйЭлемент.ПроверитьОбязательныеРеквизиты(НовыйЭлемент, Отказ, Сообщение);
	Если Отказ Тогда
		Сообщить("Элемент не может быть записан! " + Сообщение, СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйЭлемент.Записать();
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура СохранитьНастройку()
	
	ТекущаяСтрока = Элементы.Список.ДанныеСтроки(Элементы.Список.ТекущаяСтрока);
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Ответ = Вопрос("Заменить существующую настройку """ + ТекущаяСтрока.Наименование + """?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Закрыть(ТекущаяСтрока.Ссылка);
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		// Создание новой настройки
		Закрыть(СохранитьНовуюНастройку());
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если РежимСохраненияНастройки Тогда
		СохранитьНастройку();
	Иначе
		Если Открыта() Тогда
			ОповеститьОВыборе(ВыбраннаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекущаяСтрока = Элементы.Список.ДанныеСтроки(Элементы.Список.ТекущаяСтрока);
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Оповестить("УдаленаНастрокаОтчета", ТекущаяСтрока.Ссылка); 
		УдалитьНастройку(ТекущаяСтрока.Ссылка);
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройку(Настройка)
	
	НастройкаОбъект = Настройка.ПолучитьОбъект();
	НастройкаОбъект.Удалить();

КонецПроцедуры // УдалитьНастройку()
